Repository: 84000/data-translation-memory
Catalog: toh100-v1.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པས་ནི་ཆོས་དེ་དག་དེ་ལྟར་མཉམ་པ་ཉིད་ཀྱིས་མཉམ་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: In this way, the Tathāgata has realized, through their very sameness, that all these dharmas are equal.

source: འཇམ་དཔལ་བྱང་ཆུབ་ནི་དག་པ་དང་། དྲི་མ་མེད་པ་དང་ཉོན་མོངས་པ་མེད་པ་ཡིན་ཏེ།
en: “Awakening, Mañjuśrī, is pure, stainless, and without disturbance.

source: འཇམ་དཔལ་དེ་ལ་དག་པ་ནི་གང་དྲི་མ་མེད་པ་ནི་གང་ཉོན་མོངས་པ་མེད་པ་ནི་གང་ཞེ་ན།
en: In that respect, Mañjuśrī, what is purity, what is meant by stainless, and what is non-disturbance?

source: འཇམ་དཔལ་སྟོང་པ་ཉིད་ནི་དག་པའོ། །
en: Emptiness, Mañjuśrī, is purity;

source: མཚན་མ་མེད་པ་ནི་དྲི་མ་མེད་པའོ། །
en: no-sign is stainless;

source: སྨོན་པ་མེད་པ་ནི་ཉོན་མོངས་པ་མེད་པའོ། །
en: no-wish is non-disturbance.

source: སྐྱེ་བ་མེད་པ་ནི་དག་པའོ། །
en: Non-birth is purity;

source: མངོན་པར་འདུ་བྱ་བ་མེད་པ་ནི་དྲི་མ་མེད་པའོ། །
en: non-effort is stainless;

source: འབྱུང་བ་མེད་པ་ནི་ཉོན་མོངས་པ་མེད་པའོ། །
en: non-arising is non-disturbance.

source: རང་བཞིན་ནི་དག་པའོ།
en: The nature is purity;

source: ཡོངས་སུ་དག་པ་ནི་དྲི་མ་མེད་པའོ། །
en: complete purity is stainless;

source: འོད་གསལ་བ་ནི་ཉོན་མོངས་པ་མེད་པའོ། །
en: luminosity is non-disturbance.

source: སྤྲོས་པ་མེད་པ་ནི་དག་པའོ། །
en: No elaboration is purity;

source: སྤྲོས་པ་དང་བྲལ་བ་ནི་དྲི་མ་མེད་པའོ། །
en: freedom from elaboration is stainless;

source: སྤྲོས་པ་ཉེ་བར་ཞི་བ་ནི་ཉོན་མོངས་པ་མེད་པའོ།
en: the pacification of elaborations is non-disturbance.

source: སྤྲོས་པ་ཉེ་བར་ཞི་བ་ནི་ཉོན་མོངས་པ་མེད་པའོ། །
en: the pacification of elaborations is non-disturbance.

source: དེ་བཞིན་ཉིད་ནི་དག་པའོ། །
en: The tathatā is purity;

source: ཆོས་ཀྱི་དབྱིངས་ནི་དྲི་མ་མེད་པའོ། །
en: the dharmadhātu is stainless;

source: ཡང་དག་པའི་མཐའ་ནི་ཉོན་མོངས་པ་མེད་པའོ།
en: the pinnacle of reality is non-disturbance.

source: ནམ་མཁའ་ནི་དག་པའོ། །
en: Space is purity;

source: ནམ་མཁའ་ནི་ཉོན་མོངས་པ་མེད་པའོ། །
en: the sky is stainless;

source: བར་སྣང་ནི་དྲི་མ་མེད་པའོ། །
en: the atmosphere is non-disturbance.

source: ནང་ཡོངས་སུ་ཤེས་པ་ནི་དག་པའོ། །
en: “To thoroughly cognize inside is purity;

source: ཕྱི་རོལ་ཏུ་རྒྱུ་བ་མེད་པ་ནི་དྲི་མ་མེད་པའོ། །
en: not to move forth on the outside is stainless;

source: ཕྱི་ནང་དམིགས་སུ་མེད་པ་ནི་ཉོན་མོངས་པ་མེད་པའོ། །
en: non-perception inside and outside is non-disturbance.

source: ཕུང་པོ་ཡོངས་སུ་ཤེས་པ་ནི་དག་པའོ། །
en: To thoroughly cognize the aggregates is purity;

source: ཁམས་རང་བཞིན་མེད་པ་ནི་དྲི་མ་མེད་པའོ། །
en: the essencelessness of the bases is stainless;

source: སྐྱེ་མཆེད་རྣམས་སྤོང་བ་ནི་ཉོན་མོངས་པ་མེད་པའོ། །
en: putting away the entrances is non-disturbance.

source: འདས་པ་ལ་ཟད་པར་ཤེས་པ་ནི་དག་པའོ། །
en: To cognize past destruction is purity;

source: མ་འོངས་པ་ལ་མི་སྐྱེ་བར་ཤེས་པ་ནི་དྲི་མ་མེད་པའོ། །
en: to cognize future non-arising is stainless;

source: ད་ལྟར་བྱུང་བ་ལ་ཆོས་གནས་པར་ཤེས་པ་ནི་ཉོན་མོངས་པ་མེད་པའོ། །
en: to cognize the present abiding of the dharmadhātu is non-disturbance.

source: འཇམ་དཔལ་དེ་ལྟར་དག་པ་དང་དྲི་མ་མེད་པ་དང་། ཉོན་མོངས་པ་མེད་པ་ནི་གནས་གཅིག་ཏུ་ཡང་དག་པར་འདུ་སྟེ།
en: “In this way, Mañjuśrī, purity, the stainless, and non-disturbance are collected within a single basis:

source: ཞི་བའི་གནས་སུའོ། །
en: the peaceful basis.

source: ཞི་བ་གང་ཡིན་པ་དེ་ནི་རབ་ཏུ་ཞི་བ་ཡིན་ནོ། །
en: That which is peaceful is very peaceful.

source: རབ་ཏུ་ཞི་བ་གང་ཡིན་པ་དེ་ནི་ཉེ་བར་ཞི་བ་ཡིན་ནོ། །
en: That which is very peaceful is utterly peaceful.

source: ཉེ་བར་ཞི་བ་གང་ཡིན་པ་དེ་ནི་ཉེ་བར་ཞི་བར་གྱུར་པ་ཡིན་ནོ། །
en: That which is utterly peaceful is utter pacification;

source: ཉེ་བར་ཞི་བར་གྱུར་གང་ཡིན་པ་དེ་ནི་ཐུབ་པ་ཞེས་བྱའོ། །
en: utter pacification is called the sage.

source: འཇམ་དཔལ་དེ་ལྟར་ན་ནམ་མཁའ་ཇི་ལྟ་བར་བྱང་ཆུབ་ཀྱང་དེ་བཞིན་ནོ། །
en: Thus, Mañjuśrī, just like space, so is awakening.

source: བྱང་ཆུབ་ཇི་ལྟ་བར་ཆོས་རྣམས་ཀྱང་དེ་བཞིན་ནོ། །
en: Just like awakening, so are the dharmas.

source: ཆོས་རྣམས་ཇི་ལྟ་བར་སེམས་ཅན་རྣམས་ཀྱང་དེ་བཞིན་ནོ། །
en: Just like the dharmas, so are sentient beings.

source: སེམས་ཅན་རྣམས་ཇི་ལྟ་བར་ཞིང་རྣམས་ཀྱང་དེ་བཞིན་ནོ། །
en: Just like sentient beings, so are the fields.

source: ཞིང་རྣམས་ཇི་ལྟ་བར་མྱ་ངན་ལས་འདས་པ་ཡང་དེ་བཞིན་ནོ། །
en: Just like the fields, so is nirvāṇa.

source: འཇམ་དཔལ་དེའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་མྱ་ངན་ལས་འདས་པ་དང་མཉམ་པ་ཞེས་བྱ་སྟེ།
en: Therefore, Mañjuśrī, it is said that all dharmas are the same as nirvāṇa.

source: མཐར་ཐུག་པར་གྱུར་པའི་ཕྱིར་གཉེན་པོ་མེད་པ་ཡིན་ལ།
en: Since this is their ultimate mode, there is no counteragent.

source: གཉེན་པོ་མེད་པའི་ཕྱིར་གཟོད་མ་ནས་དག་པ་དང་།
en: Because there is no counteragent, they are primordially pure,

source: གཟོད་མ་ནས་དྲི་མ་མེད་པ་དང་།
en: primordially stainless, and

source: གཟོད་མ་ནས་ཉོན་མོངས་པ་མེད་པ་ཡིན་ནོ། །
en: primordially without disturbances.

source: འཇམ་དཔལ་དེ་ལ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཐམས་ཅད་དེ་ལྟར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་སེམས་ཅན་རྣམས་ཀྱི་ཁམས་ལ་རྣམ་པར་གཟིགས་པ་ནི་སེམས་ཅན་རྣམས་ལ་དག་པ་དྲི་མ་མེད་པ་ཉོན་མོངས་པ་མེད་པས་རྣམ་པར་རོལ་བ་ཞེས་བྱ་བའི་ཐུགས་རྗེ་ཆེན་པོ་སྐྱེ་བར་འགྱུར་རོ། །
en: It is thus, Mañjuśrī, that the Tathāgata realized all dharmas to be; as he observes the sphere of sentient beings, a pure, great compassion that is free from disturbances, called play, comes about toward those sentient beings.

source: འཇམ་དཔལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ཡིན་ཞེ་ན། །
en: “Mañjuśrī, how does a bodhisattva practice within the conduct of a bodhisattva?

source: འཇམ་དཔལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ཡིན་ཞེ་ན།
en: “Mañjuśrī, how does a bodhisattva practice within the conduct of a bodhisattva?

source: འཇམ་དཔལ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ཟད་པའི་ཕྱིར་རློམ་སེམས་སུ་མི་བྱེད་ཅིང་མ་ཟད་པའི་ཕྱིར་ཡང་མ་ཡིན། སྐྱེ་བའི་ཕྱིར་ཡང་མ་ཡིན། མི་སྐྱེ་བའི་ཕྱིར་ཡང་མ་ཡིན། གཏན་ཟད་པ་ཟད་པར་བྱ་བའི་ཕྱིར་ཡང་མ་ཡིན། །
en: Mañjuśrī, a bodhisattva does not think of destruction, arising, non-destruction, non-arising, and the utter destruction of destruction;

source: གཏན་མི་སྐྱེ་བ་རྣམ་པར་འཁྲུགས་པར་ཡང་མི་བྱེད་པ་དེ་ལྟར་སྤྱོད་ན།
en: nor is he disturbed by utter non-arising.

source: འཇམ་དཔལ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདས་པའི་སེམས་ལ་ཟད་པ་ཞེས་བྱ་བར་མི་སྤྱོད།
en: Furthermore, Mañjuśrī, a bodhisattva does not practice by thinking, ‘The past mind is destroyed;’

source: མ་འོངས་པའི་སེམས་ལ་མ་ཐོབ་པ་ཞེས་བྱ་བར་མི་སྤྱོད།
en: he does not practice by thinking, ‘The future mind has yet to be obtained;’

source: ད་ལྟར་བྱུང་བའི་སེམས་ལ་ཡོད་ཅེས་བྱ་བར་མི་སྤྱོད་
en: he does not practice by thinking, ‘The present mind abides.’

source: ཅིང་འདས་པ་དང་མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སེམས་ལ་ཆགས་པར་མི་འགྱུར་བ་དེ་ལྟར་སྤྱོད་ན།
en: He is not stuck in the past, future, or present mind. As he practices in this way,

source: འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ཡིན་ནོ། །
en: Mañjuśrī, a bodhisattva practices within the conduct of a bodhisattva.

source: འཇམ་དཔལ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་དང་། བྱང་ཆུབ་དང་། སེམས་ཅན་རྣམས་དང་། དེ་བཞིན་གཤེགས་པ་དེ་ལ་གཉིས་སུ་མེད་དེ།
en: “Mañjuśrī, giving, awakening, and sentient beings and, on the other hand, the Tathāgata: these are non-dual,

source: གཉིས་སུ་བྱར་མེད་པ་དེ་ལྟར་སྤྱོད་ན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ཡིན་ནོ།
en: they are not divided into two. Practicing in this way, a bodhisattva practices within the conduct of a bodhisattva.

source: འཇམ་དཔལ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་དང་། བྱང་ཆུབ་དང་། སེམས་ཅན་རྣམས་དང་། དེ་བཞིན་གཤེགས་པ་དེ་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་པ་དེ་ལྟར་སྤྱོད་ན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ཡིན་ནོ།
en: Mañjuśrī, discipline, awakening, and sentient beings and, on the other hand, the Tathāgata: these are non-dual, they are not divided into two. Practicing in this way, a bodhisattva practices within the conduct of a bodhisattva.

source: བྱང་ཆུབ་དང་། སེམས་ཅན་རྣམས་དང་།
en: awakening, and sentient beings and,

source: དེ་བཞིན་གཤེགས་པ་དང་། བརྩོན་འགྲུས་དང་བྱང་ཆུབ་དང་། སེམས་ཅན་རྣམས་དང་།
en: the Tathāgata; diligence, awakening, and sentient beings, and,

source: དེ་བཞིན་གཤེགས་པ་དང་།
en: the tathāgata,

source: གཉིས་སུ་མེད་དེ་གཉིས་སུ་དབྱེར་མེད་པ་
en: These are non-dual, they are not divided into two.

source: འཇམ་དཔལ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་གཟུགས་སྟོང་ཞེས་བྱ་བར་མི་སྤྱོད། མི་སྟོང་ཞེས་བྱ་བར་མི་སྤྱོད་པ་དེ་ལྟར་སྤྱོད་ན།
en: “Mañjuśrī, a bodhisattva may practice thinking that ‘form is not empty’ and also ‘not non-empty.’

source: འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: Practicing in this way, Mañjuśrī, that bodhisattva practices within the conduct of a bodhisattva.

source: གཟུགས་ནི་གཟུགས་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །
en: ‘Form itself is empty of the essence of form.

source: དེ་བཞིན་དུ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་སྟོང་ཞེས་བྱ་བར་མི་སྤྱོད་མི་སྟོང་ཞེས་བྱ་བར་མི་སྤྱོད་པ་དེ་ལྟར་སྤྱོད་ན། །
en: In the same way, feeling, notion, co-producing factors, and consciousness are empty.’ He practices thinking in this way and also thinking that ‘they are not non-empty.’

source: ་དེ་བཞིན་དུ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་སྟོང་ཞེས་བྱ་བར་མི་སྤྱོད་མི་སྟོང་ཞེས་བྱ་བར་མི་སྤྱོད་པ་དེ་ལྟར་སྤྱོད་ན།
en: n the same way, feeling, notion, co-producing factors, and consciousness are empty.’ He practices thinking in this way and also thinking that ‘they are not non-empty.’

source: འཇམ་དཔལ་སེམས་དང་། ཡིད་དང་། རྣམ་པར་ཤེས་པ་དམིགས་སུ་མེད་པའི་ཕྱིར་གང་ཡོངས་སུ་ཤེས་པའམ། སྤང་བའམ། བསྒོམ་པའམ། མངོན་སུམ་དུ་བྱ་བའི་ཆོས་དེ་དག་གང་ཡོད་པ་མ་ཡིན་པའི་ཕྱིར་རོ། །
en: Because mind, mentality, and consciousness are not perceived. “Mañjuśrī, there is no dharma whatsoever that could be thoroughly cognized, dispelled, cultivated, or directly realized.

source: འཇམ་དཔལ་ཟད་པ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་གཏན་ཟད་པ་ཁོ་ན་ཡིན་ནོ། །
en: Mañjuśrī, that which is understood as destruction is simply the destruction of extremes.

source: གཏན་ཟད་པ་གང་ཡིན་པ་དེ་ནི་ཟད་པར་བྱ་བ་མ་ཡིན་ནོ།
en: And that which is completely destroyed is not something one should cause to be destroyed.

source: ཟད་པར་བྱ་བ་མ་ཡིན་པའི་ཕྱིར་མི་ཟད་པ་ཡིན་ནོ། །
en: As it is indestructible and not destroyed, it is without destruction.

source: ་དེ་ནི་ཇི་ལྟ་བ་བཞིན་དུ་ཟད་པ་ཡིན་ལ།
en: It conforms to destruction;

source: ཟད་པ་གང་ཡིན་པ་དེ་ལ་ནི་ཟད་པ་ཅུང་ཟད་ཀྱང་མེད་ལ།
en: conforming to destruction is the destruction of nothing whatsoever.

source: གང་ལ་ཟད་པ་ཅུང་ཟད་ཀྱང་མེད་པ་དེ་ནི་འདུས་མ་བྱས་པ་སྟེ།
en: And that, wherein there is no destruction of anything whatsoever, is unproduced.

source: འདུས་མ་བྱས་པ་གང་ཡིན་པ་དེ་ལ་ནི་སྐྱེ་བ་ཡང་མེད།
en: With respect to the unproduced, there is no arising

source: འགག་པ་ཡང་མེད་པའི་ཕྱིར་རོ། །
en: and no cessation.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་། མ་བྱུང་ཡང་རུང་།
en: “Therefore it is said, ‘Whether the tathāgatas arise or not,

source: ཆོས་ཉིད་དང་། ཆོས་གནས་པ་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་འདི་ནི་གནས་པ་ཁོ་ན་ཞེས་བྱ་སྟེ།
en: this dharmatā is invariable; it is the invariability of the dharmas, the dharmadhātu.’

source: ཇི་ལྟར་ཆོས་ཀྱི་དབྱིངས་ལ་གནས་པ་དེ་བཞིན་དུ་ཤེས་པ་དེ་ཡང་འཇུག་པར་མི་བྱེད་ལྡོག་པར་མི་བྱེད་དོ། །
en: Just like the invariability of the dharmadhātu, the Tathāgata’s awareness is neither occurring nor ceasing.

source: ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པས་ཟག་པ་སྐྱེད་པར་མི་བྱེད། འགག་པར་མི་བྱེད་དོ།
en: Entering the Dharma method in this way, the outflows do not arise and do not cease.

source: འཇམ་དཔལ་ཟག་པ་ཟད་པ་ཞེས་བྱ་བ་དེ་ནི་ཐ་སྙད་དང་། སྒྲ་དང་། ཡི་གེ་དང་། བརྡར་གདགས་པ་ཡིན་ཏེ།
en: The destruction of the outflows, Mañjuśrī, is a conventional expression, speech, syllables, sign, and designation.

source: འདི་ལ་ནི་སྐྱེ་བའམ། འགག་པར་འགྱུར་བའི་ཆོས་གང་ཡང་མེད་དོ། །
en: Here no dharma whatsoever arises or ceases.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྟན་ལས་ལངས་ཏེ།
en: Then the youthful Mañjuśrī rose from his seat,

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས།
en: folded his upper robe,

source: པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: placed his right knee on the ground.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: Folding his hands in the direction of the Bhagavat,

source: བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །
en: he praised him with these verses:

source: ཁ་དོག་རྟགས་དང་དབྱིབས་མི་མངའ། །
en: “You have no color, sign, or shape,

source: མི་འགག་འབྱུང་བ་མི་མངའ་བ།
en: No cessation or origination,

source: རྩ་བ་མི་མངའ་གནས་མི་མངའ། །
en: No root and no ground to stand upon,

source: མི་རྟེན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: you are free of any point of reference: I bow to you!

source: མི་རྟེན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: you are free of any point of reference: I bow to you!

source: མི་གནས་གནས་པ་མི་མངའ་བ། །
en: “You have no ground to stand upon,

source: བླང་བ་མི་མངའ་དོར་མི་མངའ། །
en: No striving or giving up;

source: དྲུག་ལས་རྣམ་གྲོལ་བ།
en: free from the six entrances,

source: ཆོས་རྣམས་ཀུན་ལ་མི་གནས་ཤིང་། །
en: “You are not situated in any dharma,

source: དངོས་དང་དངོས་མེད་རྣམ་པར་སྤངས། །
en: Bereft of existence or non-existence.

source: འདུ་བྱེད་མཉམ་པ་ཉིད་བརྙེས་པ། །
en: You obtained the sameness of co-producing factors,

source: ཁམས་གསུམ་དག་ལས་རྣམ་པར་གྲོལ། །
en: “Free from the three world spheres,

source: མཁའ་ལྟར་མཉམ་ཉིད་ཐུགས་སུ་ཆུད།
en: You have attained the sky’s own sameness.

source: འདོད་པ་རྣམས་ཀྱིས་མི་གོས་པ། །
en: You are not defiled by desires,

source: རྟག་ཏུ་མཉམ་པར་བཞག་མཛད་པ།
en: “You always remain in samādhi,

source: གཤེགས་དང་བཞུགས་དང་གཟིམས་པ་ཡི།
en: As you move, stand, or lie down—

source: སྤྱོད་ལམ་རྣམ་པ་ཐམས་ཅད་དུ། །
en: Whichever your posture may be.

source: མཉམ་པར་བྱོན་ཅིང་མཉམ་པར་གཤེགས། །
en: “You arrive evenly and go evenly,

source: མཉམ་པ་ཉིད་ལ་གནས་པ་པོ། །
en: Remaining well placed in sameness.

source: མཉམ་ཞིང་འཁྲུགས་པར་མི་མཛད་པ། །
en: You are not disturbed at sameness,

source: མཉམ་པ་ཉིད་ལ་ཞུགས་གྱུར་ཅིང་། །
en: “You are absorbed in sameness,

source: ཆོས་རྣམས་ཀུན་ལ་མཉམ་པར་བཞག །
en: In samādhi within all dharmas.

source: མཚན་མ་མེད་ལ་ཞུགས་གྱུར་པ། །
en: Absorbed in the sign-less,

source: མི་གནས་དམིགས་པ་མི་མངའ་བ། །
en: “Unplaced, without point of reference,

source: ཤེས་རབ་བསགས་ཤིང་མཉམ་པར་བཞག །
en: Your samādhi is the peak of wisdom.

source: ཆོས་ལ་མངའ་དབང་བརྙེས་གྱུར་པ། །
en: You have become the lord of Dharma,

source: སེམས་ཅན་ཀུན་གྱི་སྒྲ་སྐད་དང་། །དེ་བཞིན་གཟུགས་དང་སྤྱོད་ལམ་དག །སྐད་ཅིག་གཅིག་གིས་གཟིགས་མཛད་པ། །
en: “In one instant, you see The forms, voices, and postures Of all sentient beings.

source: མིང་དང་གཟུགས་ལས་རྣམ་པར་གྲོལ། །
en: “Free from name and form,

source: རྒྱུ་དང་ཕུང་པོ་ཐམས་ཅད་བཅད། །
en: You cut off all causes and aggregates.

source: རྣམ་པ་མེད་ལ་འཇུག་མཛད་པ། །
en: You are the entrance into the aspect-less,

source: མཚན་མ་དག་དང་རྣམ་བྲལ་ཞིང་། །
en: “You are free from signs

source: མཚན་མའི་རྣམ་པ་རྣམ་པར་སྤངས། །
en: And bereft of their aspects.

source: མཚན་མ་མེད་ལ་འཇུག་མཛད་པ། །
en: You are the entrance into the sign-less,

source: ཡང་དག་རྟོག་པ་རྣམ་མ་བརྟགས། །
en: “You do not form concepts,

source: ཐུགས་ཡིད་རབ་ཏུ་མི་གནས་ཤིང་། །
en: your mind has no ground to stand upon.

source: ཡིད་མཛད་མི་མངའ་མི་དགོངས་པ། །
en: You have no recollection or mental placement,

source: ནམ་མཁའ་འདྲ་བར་གནས་མི་མངའ། །
en: “Space is without abode;

source: ཐོགས་པ་མི་མངའ་སྤྲོས་མི་མངའ། །
en: It is free from elaboration and stainless.

source: ནམ་མཁའ་མཉམ་པའི་ཐུགས་མངའ་བ། །
en: Your mind is the same as space,

source: ནམ་མཁའ་དབུས་མཐའ་མ་མཆིས་པ། །
en: “Space is without edge or center,

source: སངས་རྒྱས་ཆོས་ཉིད་དེ་དང་འདྲ། །
en: so, too, is the dharmatā of the buddhas.

source: དུས་གསུམ་ཡང་དག་འདས་གྱུར་པ། །
en: You have gone beyond the three times,

source: ནམ་མཁའི་མཚན་ཉིད་སངས་རྒྱས་ཏེ། །
en: “The buddhas have the characteristic of space,

source: ནམ་མཁའང་མཚན་ཉིད་མཆིས་མ་ལགས། །
en: And space has no characteristics.

source: རྒྱུ་དང་འབྲས་བུ་རྣམ་གྲོལ་བ། །
en: You are free from effect and cause,

source: གཟུང་བ་མ་མཆིས་ཆུ་ཟླ་འདྲ། །
en: “Like the moon in the water,

source: ངར་འཛིན་མི་མངའ་སྒྲ་མི་མངའ། །
en: you cannot be grasped:

source: ཆོས་རྣམས་ཀུན་ལ་མི་གནས་པ། །
en: You are not placed in any dharma.

source: ཕུང་པོ་རྣམས་དང་སྐྱེ་མཆེད་དང་། །ཁམས་རྣམས་དག་ལ་མི་གནས་ལ། །
en: “You are not dwelling in the aggregates, The bases, or the entrances.

source: ཕྱིན་ཅི་ལོག་ལས་རྣམ་པར་གྲོལ། །
en: You are free from distortions,

source: མཐའ་གཉིས་དག་ལས་རྣམ་གྲོལ་ཞིང་། །
en: “Free from the two extremes,

source: བདག་ཏུ་ལྟ་བ་ཡང་དག་བཅད། །
en: You cut off the view of ‘self.’

source: ཆོས་དབྱིངས་མཉམ་པ་ཉིད་བརྙེས་པ། །
en: You obtained sameness with the dharmadhātu,

source: གཟུགས་ཀྱི་གྲངས་ལས་རྣམ་གྲོལ་ཞིང་། །
en: “You are free from form and number,

source: དམ་ཆོས་མ་ལགས་རྣམ་པར་སྤངས། །
en: bereft of any false dharmas.

source: ལེན་དང་གཏོང་བ་མི་མངའ་བ། །
en: You neither cling to, nor abandon,

source: བདུད་ཀྱི་མིང་ལས་རབ་འདས་ཤིང་། །
en: “You have gone beyond the faults of Māra

source: ཆོས་ཀུན་རྟོགས་པར་ཐུགས་སུ་ཆུད། །
en: reached the path of the dharmadhātu.

source: སྒྲིབ་པ་མི་མངའ་ཆོས་གྱུར་པ། །
en: You have the feature of non-obscuration,

source: དོན་འཚལ་རྣམས་ཀྱིས་མཆིས་མི་བརྗོད། །མ་མཆིས་ཤེས་ཀྱང་བརྗོད་མི་བགྱི། །
en: “Those who understand the meaning, Do not say ‘he exists’ or ‘he does not.’

source: ལན་མེད་ཚིག་ལམ་མ་མཆིས་པ། །
en: You are not in the realm of words,

source: གཉིས་ཀྱི་ཆོས་ལ་མི་རྟེན་པར། །
en: “Not relying on duality,

source: རྒྱལ་མཚན་ཀུན་ཏུ་བཙུགས། །
en: You cut down the banner of pride.

source: གཉིས་དང་གཉིས་མེད་རྣམ་གྲོལ་བ།
en: You are free from duality and non-duality,

source: ཁྱོད་ཀྱིས་ཡིད་ཀྱི་ཉེས་པ་དང་། །ལུས་ཀྱི་ནད་བཞི་ཕམ་པར་མཛད། །
en: “You have subdued all mental flaws, And the four flaws of the body.

source: བསམ་ཡས་དཔེ་དང་རྣམ་བྲལ་བ། །
en: You are inconceivable, without compare,

source: ལྷུན་གྱིས་གྲུབ་པར་འཇུག་མཛད་ཅིང་། །
en: “You conduct yourself effortlessly,

source: ཉེས་པ་ཐམས་ཅད་རྣམ་པར་སྤངས། །
en: you are bereft of any flaws.

source: སྤྱོད་པ་མཁྱེན་པས་ཐོག་དྲངས་པ། །
en: Awareness precedes all your actions,

source: ཁྱོད་དགོངས་ཞི་ཞིང་ཟག་མི་མངའ། །
en: Your recollection has no outflows:

source: འབྱུང་མིན་འབྱུང་བའི་བདག་ཉིད་ཅན། །
en: It is subtle and conforms to what is real and unreal.

source: གནས་དང་རྟོག་པ་མི་མངའ་བ། །
en: You have no abode and no thoughts,

source: དམིགས་པ་མི་མངའ་ཐུགས་ཀྱིས་སུ། །
en: “With your mind free of a point of reference,

source: ཀུན་གྱི་སེམས་ནི་རབ་ཏུ་མཁྱེན། །
en: You understand well the mind of all,

source: བདག་གཞན་འདུ་ཤེས་མི་མངའ་བ། །
en: While having no notion of ‘self’ and ‘others.’

source: དམིགས་དང་དམིགས་པ་རྣམས་ཀྱིས་ནི། །
en: “Taking up points of reference

source: ཀུན་གྱི་སེམས་ནི་རྨོངས་པར་བགྱིད། །
en: Makes everyone’s mind bewildered.

source: སྒྲིབ་པ་མེད་པའི་ཆོས་གྱུར་པ། །
en: You remain unobscured,

source: དམིགས་པ་དག་དང་སེམས་རྣམས་ནི། །
en: a mind without point of reference

source: ངོ་བོ་ཉིད་ཀྱི་མཆིས་མ་ལགས། །
en: Cannot essentially be found.

source: བསམ་ཡས་མཉམ་པ་ཉིད་བརྙེས་པ། །
en: You obtained inconceivable sameness,

source: གནས་པ་མི་མངའ་མཁྱེན་པ་ཡིས། །
en: “With your unplaced awareness,

source: ཞིང་རྣམས་ཀུན་དང་དེ་བཞིན་དུ། །
en: You see all the fields,

source: སེམས་ཅན་ཀུན་གྱི་སྤྱོད་གཟིགས་པ། །
en: And the conduct of all beings.

source: སངས་རྒྱས་རྣམས་ཀྱིས་ལན་འགའ་ཡང་། །སེམས་དང་ཆོས་ཀུན་གཏན་མ་དམིགས། །
en: “The buddhas do not apprehend the mind, In any way, ever;

source: ཆོས་རྣམས་ཐམས་ཅད་ཀུན་མཁྱེན་པ། །
en: you know everything about all dharmas.

source: ཆོས་ཀུན་སྒྱུ་མ་ལྟ་བུ་སྟེ། །
en: “Illusion-like are all dharmas,

source: སྒྱུ་མ་ཉིད་ཀྱང་མཆིས་མ་ལགས། །
en: Yet the illusion itself cannot be found.

source: སྒྱུ་མའི་ཆོས་ལས་རྣམ་གྲོལ་བ། །
en: You are free from the dharma of illusion,

source: རྫོགས་སངས་འཇིག་རྟེན་སྤྱོད་མཛད་ཀྱང་། །
en: “Perfect Buddha, you act in the world,

source: འཇིག་རྟེན་ཆོས་ལ་རྟེན་མི་མཛད། །
en: Not dwelling upon worldly dharmas,

source: འཇིག་རྟེན་རྣམ་རྟོག་མི་མངའ་བ།
en: you do not form concepts about the ‘world.’

source: སྟོང་པ་སྟོང་པར་སྟོན་མཛད་པ། །
en: You declare what is empty as empty,

source: སྒྱུ་མ་ལྟ་བུའི་ཏིང་འཛིན་དང་། །སྒྱུ་འཕྲུལ་ཆེན་པོས་རྣམ་འཕྲུལ་ཞིང་། །
en: “Through great powers and illusory samādhi, You perform miracles.

source: ཐ་དད་མ་མཆིས་སྙོམས་ཞུགས་པ།
en: You are absorbed into freedom from multiplicity,

source: དུ་མ་མ་ལགས་གཅིག་མ་ལགས། །
en: “You are neither one, nor many,

source: རིང་དང་ཉེ་ལ་མི་འཇུག་ཅིང་། །
en: You are neither far, nor near.

source: གདེག་དང་གཞག་པ་མི་མངའ་བ། །
en: You neither remove, nor add,

source: རྡོ་རྗེ་ལྟ་བུའི་ཏིང་འཛིན་གྱིས། །
en: “Through the diamond-like samādhi,

source: སྐད་ཅིག་གཅིག་ལ་མངོན་སངས་རྒྱས། །
en: You obtained supreme awakening in one instant.

source: དངོས་མ་མཆིས་པར་མཉམ་གཞག་པ། །
en: You are absorbed into non-appearance,

source: འདྲེན་པ་དུས་རྣམས་ཐམས་ཅད་དུ། །མི་གཡོ་མྱ་ངན་འདས་པ་རྟོགས། །
en: “You know nirvāṇa to be unmoving in the three times.

source: སྣ་ཚོགས་ཐབས་དང་ལྡན་པ་པོ། །
en: You are a guide endowed with many methods,

source: སེམས་ཅན་རྣམས་ཀྱི་བརྒྱུད་པའི་ཐབས། །
en: “You are expert in understanding which methods,

source: དེ་ཕྱིར་མི་གཡོ་མྱ་ངན་འདས། །
en: You know nirvāṇa to be unmoving,

source: མཚན་མ་མི་མངའ་ལྷུན་གྱིས་གྲུབ།
en: “You are free from signs, effortless,

source: སྤྲོས་པ་མི་མངའ་སྐྱོན་མི་མངའ།
en: Free from elaboration, and untainted.

source: སྣང་མེད་བདག་གི་མི་མངའ་བ། །
en: Free from appearance, free from a ‘self,’

source: རྣམ་རྟོག་མི་མངའ་སྐྱོན་མི་མངའ། །
en: “Free from concepts, free from what belongs to a self,

source: བདག་གིས་བདག་ཉིད་ཇི་བཞིན་པར། །
en: You yourself know the self as it is.

source: ཀུན་ཏུ་མཁྱེན་པ་ཐམས་ཅད་མཁྱེན། །
en: You are omniscient with respect to everything,

source: སྟོབས་བཅུ་ཆུ་བོ་རྒལ་བ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “I salute you, who have ten powers and have crossed the stream.

source: འཇིགས་བྲལ་འཇིགས་མེད་སྩོལ་བ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: I salute you, the fearless one who bestows fearlessness.

source: མ་འདྲེས་ཆོས་རྣམས་ངེས་པར་ཐུགས་སུ་ཆུད་གྱུར་པ། །
en: You obtained certainty in the unshared dharmas:

source: འགྲོ་བ་ཀུན་གྱི་འདྲེན་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Guide for the entire world, I salute you.

source: ཀུན་སྦྱོར་འཆིང་བ་བཅད་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “I salute you, who break the bondage of fetters,

source: ཕ་རོལ་བྱོན་ཏེ་ཐང་ལ་བཞུགས་ལ་ཕྱག་འཚལ་ལོ། །
en: I salute you, who reached the other shore and remain on dry ground.

source: སྐྱེ་བོ་ངལ་བའི་རྣམ་འདྲེན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: I salute you, guide for the exhausted world.

source: འཁོར་བར་གཤེགས་ཤིང་མི་གནས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: I salute you, who go to saṃsāra and remain unplaced.

source: ཇི་ལྟར་པད་མ་ཆབ་ཀྱིས་གོས་པར་མི་འགྱུར་ཞིང་། །
en: You are untainted, like a lotus by the waters it grows in;

source: སངས་རྒྱས་ཐུབ་པ་ཁྱོད་ཀྱིས་སྟོང་ཉིད་ཤིན་ཏུ་བསྟེན། །
en: Sage, Buddha, you practiced emptiness!

source: སྟོན་པའི་གོ་འཕང་བླ་མེད་དབེན་པ་ཉིད་ལགས་ཏེ། །
en: “Isolation is the unexcelled state of the Teacher;

source: དམིགས་མེད་ཆུ་བོ་རྒལ་བ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: I salute you, who are free from a point of reference and crossed the great stream.

source: མཚན་མ་ཐམས་ཅད་རྣམ་པ་ཀུན་ཏུ་རྣམ་པར་བཤིག །ཁྱོད་ལ་གར་ཡང་སྨོན་པར་མཛད་པ་མཆིས་མ་ལགས། །
en: You have thoroughly eliminated all signs, And you wish for nothing whatsoever.

source: སངས་རྒྱས་མཐུ་ཆེན་བསམ་གྱིས་ཁྱབ་པ་མ་ལགས་ཏེ། །མི་གནས་ནམ་མཁའ་མཉམ་པ་ཉིད་ལ་ཕྱག་འཚལ་ལོ། །
en: “I salute the inconceivable Buddha of great power, Who is the same as space and without abode.

source: ཡོན་ཏན་ཀུན་གྱི་མཆོག་མངའ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: I salute you, supreme holder of all good qualities.

source: དཔལ་འཕགས་ལྷུན་པོ་འདྲ་བ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: I salute you, whose glory rises up like Meru.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: Then the Bhagavat praised the youthful Mañjuśrī:

source: འཇམ་དཔལ་ལེགས་སོ་ལེགས་སོ། །
en: “Good, Mañjuśrī, that is good!

source: འཇམ་དཔལ་ཁྱོད་ཀྱིས་ལེགས་པར་སྨྲས་སོ། །
en: You have spoken well, Mañjuśrī.

source: འཇམ་དཔལ་དེ་དེ་བཞིན་ཏེ།
en: It is just as you said.

source: འཇམ་དཔལ་སངས་རྒྱས་རྣམས་ནི་གཟུགས་ལས་བལྟ་བར་མི་བྱ་སྟེ། ཆོས་ལས་མ་ཡིན། མཚན་མ་ལས་མ་ཡིན། ཆོས་ཀྱི་དབྱིངས་ལས་ཀྱང་མ་ཡིན་ནོ། །
en: Mañjuśrī, the buddhas should not be seen through form, through dharmas, through characteristics, or through the dharmadhātu.

source: སངས་རྒྱས་རྣམས་ནི་ཉག་གཅིག་བཞུགས་པ་མ་ཡིན།
en: The buddhas do not stay by themselves

source: སྐྱེ་བོ་མང་པོའི་ནང་ན་བཞུགས་པ་མ་ཡིན་ནོ། །
en: nor do they reside among many people.
